Repository: sushain97/apertium-monorepo-svn-82937
Catalog: incubator/en-ga-corpus/tmx/1922-2.tmx
Source language: en
Languages: ga

source: (2) If any question shall arise as to which Minister, Official, Department or Authority exercises in Saorstát Eireann functions the same as or corresponding to the functions exercised by any Minister, Official, Department or Authority of the Government of the late United Kingdom or of the late British Government in Ireland, such question shall be determined by the President of the Executive Council, whose decision shall be final
ga: (2) Má éiríonn aon cheist i dtaobh ce'ca Aire, ce'ca Oifigeach, ce'ca Roinn no ce'ca Údarás a fheidhmíonn i Saorstát Éireann feidhmeanna atá ionann no ar có-réir leis na feidhmeanna d'fheidhmíodh aon Aire, Oifigeach, Roinn no Údarás de Rialtas na Ríochta Aontuithe a bhí ann le déanai no den Rialtas Briotáineach a bhí in Éirinn, socróidh Uachtarán na hArd-Comhairle an cheist sin agus ní bheidh dul thar a bhreith

source: —(1) The Executive Council of Saorstát Eireann may from time to time by Order make all such general or specific adaptations of or modifications in any British Statute which in the opinion of the Executive Council are necessary in order to enable such Statute to have full force and effect in Saorstát Eireann
ga: —(1) Na hoiriúnuithe no na hatharuithe sin uile, generálta no áirithe, ar aon Reacht Briotáineach a bheidh riachtanach do réir oipineoin na hÁrd-Chomhairle chun lán-fheidhm agus lánéifeacht do bheith ag an Reacht san i Saorstát Éireann féadfaidh Árd-Chomhairle Shaorstáit Éireann iad do dhéanamh ó am go ham le hOrdú

source: (2) Any such adaptation or modification as is mentioned in this section may be made notwithstanding that same is covered or effected by any general adaptation or modification made by this Act but no adaptation or modification shall be made under this section which is inconsistent with any adaptation or modification made by this Act
ga: (2) Féadfar aon oiriúnú no atharú den tsórt a luaidhtear san alt so do dhéanamh in ainneoin é bheith foluithe no déanta le haon oiriúnú no atharú generálta a dintar leis an Acht so ach ní déanfar fén alt so aon oiriúnú ná atharú a bheidh buiniscionn le haon oiriúnú no atharú a dintar leis an Acht so

source: —(1) The Minister for Finance may make regulations to apply to the importation and exportation of any goods into and from the Irish Free State by land, any of the provisions of the Customs Act subject to such modifications as may be necessary and in particular, the regulations may:—
ga: —(1) Tar éis aon atharuithe a bheidh riachtanach do dhéanamh orra, féadfaidh an t-Aire um Airgead rialacháin do dhéanamh chun aon cheann d'fhorálacha Achtanna na gCustum do chur i mbaint le haon earraí d'aistriú de thír isteach i Saorstát Éireann no amach as agus, go sonnrách, féadfaidh na rialacháin:—

source: ( a ) Prohibit the importation and exportation of all goods or any classes of goods except by such routes within the Irish Free State and during such hours as may be prescribed;
ga: (a) Gach earra no aon tsaghas earra do chosc ar theacht isteach no ar dhul amach ach tré pé bealaighe laistigh de Shaorstát Éireann agus le linn pé uaire a ceapfar;

source: ( b ) Prescribe the places where and the form and manner in which entry of goods imported or exported shall be made and duty on goods imported shall be paid
ga: (b) Na háiteanna, an fhuirm agus an chuma do cheapa ina ndéanfar earraí do thabhairt isteach no do chur amach agus diúité ar earraí isteach d'íoc

source: (2) If any person contravenes or fails to comply with any such regulations, he shall be guilty of an offence under the Customs Acts and shall for every such offence, in addition to any other penalty to which he may be liable, incur a fine not exceeding £100, and the goods in respect of which the offence is committed shall be forfeited
ga: (2) Má bhriseann éinne aon cheann de sna rialacháin sin no má theipeann air iad do chó-liona, beidh sé ciontach i gcionnta fé Achtanna na gCustum agus beidh sé i mbaol fíneála ná raghaidh thar £100 mar gheall ar gach cionnta den tsórt san i dteanta aon phionóis eile is baol do agus caillfidh sé na hearraí gur ina dtaobh a bheidh an cionnta déanta aige

source: —Wherever any British Statute adapted or modified or authorised to be adapted or modified by this Act has been by adapted or modified by or under the authority of any subsequent British Statute, this Act shall be construed as referring to such Statute as so adapted or modified
ga: —I gcás aon Reachta Bhriotáinigh go ndintar leis an Acht so é do chur in oiriúint no é d'atharú no údarás a thabhairt chuige sin agus gur dineadh é do chur in oiriúint no é d'atharú le húdarás no fé údarás aon Reachta Bhriotáinigh a tháinig ina dhiaidh, tuigfear an tAct so do bheith ag tagairt don Reacht san fé mar do cuireadh in oiriúint no mar do hatharuíodh é

source: —(1) Every deed and every contract and agreement in writing made before the 6th day of December, 1922, with or by any person by or with any Minister, Department or Authority of the late British Government in Ireland or the late Provisional Government of Ireland, or by or with any Official of either of those Governments acting on behalf of such Government, shall if and so far as the terms and provisions of such deed, contract or agreement were not fully executed and completed on the 6th day of December, 1922, be construed and read as if the name of the Minister, Department, Authority or Official exercising in Saorstát Eireann functions the same as or corresponding to the functions exercised at the date of such deed, contract or agreement in respect of the area now comprised in Saorstát Eireann by the Minister, Department, Authority or Official named in such deed, contract or agreement was substituted in such deed, contract or agreement for the name of the Minister, Department, Authority or Official actually named therein
ga: —(1) Gach cairt agus gach connra agus marga i scríbhinn a dhin aon Aire, Roinn no Údarás den Rialtas Briotáineach a bhí in Éirinn le déanaí no de Rialtas Sealadach na hÉireann a bhí ann le déanai, no aon Oifigeach d'aon cheann de sna Rialtaisí sin thar ceann an Rialtais sin, le haon duine no do dhin aon duine le haon cheann aca roimh an 6adh lá de Mhí na Nodlag, 1922, déanfar, má's rud é ná raibh agus sa mhéid ná raibh, téarmaí agus forálacha na cairte, an chonnartha no an mhargaidh sin i lán-fheidhm agus i lán-chrích ar an 6adh lá de Mhí na Nodlag, 1922, iad do léiriú is do léigheamh fé is dá ndéanfaí ainm an Aire, na Roinne, an Údaráis no an Oifigigh atá ag feidhmiú i Saorstát Éireann feidhmeanna atá ionann no ar có-réir leis na feidhmeanna do bhí dá bhfeidhmiú, i dtaobh an líomatáiste gurb é Saorstát Éireann anois é, ag an Aire, an Roinn, an Údarás no an Oifigeach atá ainmnithe sa chairt, sa chonnra no sa mharga san le linn dáta na cairte, an chonnartha no an mhargaidh sin, do chur in ionad ainm an Aire, na Roinne, an Údaráis no an Oifigigh atá ainmnithe sa chairt, sa chonnra no sa mharga san

source: (2) The benefits conferred and the obligations imposed by any such deed, contract or agreement as is mentioned in the preceding sub-section of this section on the Minister, Department, Authority or Official named therein shall, so far as the same on the 6th day of December, 1922, remained to be performed, be as from that day respectively vested in or imposed on the Minister, Department, Authority or Official whose name is by the preceding sub-section of this section substituted in such deed, contract or agreement for the name of the Minister, Department, Authority or Official actually named therein as fully as if such substituted Minister, Department, Authority or Official were actually named in such deed, contract or agreement
ga: (2) Na tairbhí a bronntar agus na hoblagáidí a cuirtear le haon chairt, aon chonnra no aon mharga den tsórt atá luaidhte sa bhfo-alt roimhe seo den alt so ar an Aire, an Roinn, an Údarás no an Oifigeach atá ainmnithe ann déanfar, sa mhéid go rabhadar gan có-líona ar an 6adh lá de Mhí na Nodlag, 1922, iad do bhronna no do chur fé seach ón lá san ar an Aire, an Roinn, an Údarás no an Oifigeach go ndineann an fo-alt roimhe seo den alt so a ainm do chur in ionad ainm an Aire, na Roinne, an Údaráis no an Oifigigh atá ainmnithe sa chairt, sa chonnra no sa mharga san chó hiomlán is dá mbé ainm an Aire, na Roinne, an Údaráis no an Oifigigh go bhfuil a ainm malairtithe a bheadh sa chairt, sa chonnra no sa mharga san

source: (3) If any question shall arise as to which Minister, Department, Authority or Official exercises in Saorstát Eireann functions the same as or corresponding to the functions exercised at the date of such deed, contract or agreement as is mentioned in this section, by any Minister, Department, Authority or Official of the late British Government in Ireland, or of the late Provisional Government of Ireland, as the case may be, such question shall be determined by the President of the Executive Council whose decision shall be final and binding on all parties
ga: (3) Má éirionn aon cheist i dtaobh ce'ca Aire, ce'ca Roinn, ce'ca Údarás no ce'ca Oifigeach a fheidhmíonn i Saorstát Éireann feidhmeanna atá ionann no ar có-réir leis na feidhmeanna a bhí dá bhfeidhmiú le linn dáta na cairte, an chonnartha no an mhargaidh sin a luaidhtear san alt so ag aon Aire, aon Roinn, aon Údarás no aon Oifigeach den Rialtas Briotáineach a bhí in Éirinn le déanaí no de Rialtas Sealadach na hÉireann a bhí ann le déanaí (fé mar a bheidh), socróidh Uachtarán na hÁrd-Chomhairle an cheist sin agus ní bheidh dul thar a bhreith agus beidh ar gach n-aon géille don bhreith sin

source: —(1) Every interpretation, adaptation or modification made by this Act in the construction or application of any British Statute shall apply to every Order, Rule and Regulation made under such Statute and having the force of law in Saorstát Eireann, and every such Order, Rule and Regulation shall be construed and interpreted in conformity with the British Statute (as applied, adapted or modified by or under this Act) under which the same is made
ga: —(1) Gach míniú, oiriúnú no atharú a dhineann an t-Acht so ar léiriú no ar bhaint aon Reachta Bhriotáinigh bainfe sé le gach Ordú, Riail agus Rialachán a dineadh fén Reacht san agus ag a bhfuil feidhm dlí i Saorstát Éireann agus léireofar agus míneofar gach Ordú, Riail agus Rialachán den tsórt san do réir an Reachta Bhriotáinigh (fé mar a feidhmítear, oiriúnuítear no atharuítear é leis an Acht so no fé) fé n-ar dineadh iad

source: (2) Whenever any power is given by this Act of applying, interpreting, adapting or modifying any British Statute, such power shall extend and apply to every Order, Rule or Regulation made under such Statute and having the force of law in Saorstát Eireann
ga: (2) Pé uair a tugtar comhacht leis an Acht so chun aon Reacht Briotáineach do chur i mbaint, do mhíniú, do chur in oiriúint no d'atharú, sroisfidh agus bainfidh an chomhacht san le gach Ordú, Riail no Rialachán a dineadh fén Reacht san agus ag a bhfuil feidhm dlí i Saorstát Éireann

source: —This Act shall apply to Local and Personal Acts as well as to Public and General Acts passed by the British Parliament, and accordingly in this Act the expression "British Statute" shall include Local and Personal Acts having effect in Saorstát Eireann
ga: —Bainfidh an t-Acht so le hAchtanna Áitiúla agus Pearsanta chó maith le hAchtanna Puiblí agus Generálta do rith Páirlimint na Breataine agus dá réir sin san Acht so folóidh an abairt “Reacht Briotáineach” Achtanna Áitiúla agus Pearsanta ’na bhfuil éifeacht i Saorstát Éireann acu

source: —(1) A trustee unless expressly forbidden by the instrument (if any) creating the trust may in addition to any other mode of investment for the time being authorised, invest any trust funds in his hands whether at the time in a state of investment or not in:—
ga: —(1) Mara bhfuil sé coiscithe go soiléir air leis an ngléas (má bhíonn ann) le n-a mbunuítear an iontaoibh féadfaidh iontaobhuí aon chistí iontaoibhe atá ar láimh aige, pe'ca cistí súncálta iad an uair sin no nách eadh, do shúncáil in:—

source: ( a ) any of the existing Parliamentary Stocks or public funds or Government Securities of the late United Kingdom;
ga: (a) aon cheann dá mbeidh ann de Stuic Pháirliminte no de chistí puiblí no d'Urúsanna Rialtais na Ríochta Aontuithe a bhí ann le déanaí;

source: ( b ) any of the Parliamentary Stocks or public funds or Government Securities of Great Britain;
ga: (b) aon cheann de Stuic Pháirliminte no de chistí puiblí no d'Urúsanna Rialtais na Breataine Móire;

source: ( c ) any of the Parliamentary Stocks or public funds or Government Securities of Saorstát Eireann
ga: (c) aon cheann de Stuic Pháirliminte no de chistí puiblí no d'Urúsanna Rialtais Shaorstáit Éireann;

source: (2) In the foregoing sub-section the word "Parliamentary" is to be construed as referring in clause ( a ) to the Parliament of the late United Kingdom; in clause ( b ) to the Parliament of Great Britain, and in clause ( c ) to the Oireachtas
ga: (2) Sa bhfo-alt roimhe seo ní foláir an focal “Pháirliminte” do léiriú mar thagairt i gclás (a) do Pháirlimint na Ríochta Aontuithe a bhí ann le déanaí; i gclás (b) do Pháirliminit na Breataine Móire, agus i gclás (c) don Oireachtas

source: —Every Order made by the Executive Council under this Act shall be laid before each House of the Oireachtas forthwith and unless and until a resolution annulling such Order is passed by either House of the Oireachtas within the next subsequent twenty-one days on which that House has sat after such Order is laid before it, such Order shall have effect as if enacted in this Act, but no such resolution shall operate to prejudice the validity of anything previously done under such Order
ga: —Gach Ordú a dhéanfaidh an Árd-Chomhairle fén Acht so déanfar é do leaga fé bhráid gach Tighe den Oireachtas láithreach agus mara ndéanfaidh agus go dtí go ndéanfaidh Tigh den Oireachtas rún do rith ag cur an Orduithe sin ar neamh-ní laistigh den lá is fiche ’na dhiaidh sin go suidhfidh an Tigh tar éis an t-Ordú san do leaga féna bhráid, beidh éifeacht san Ordú san fé is dá n-achtuítí san Acht so é, ach ní fheidhmeoidh aon rún den tsórt san chun dochair do dhleathacht éinní a déanfar roimis sin fén Ordú san

source: —The expression "British Statute" shall, where the context so requires or admits, mean Act of the Parliament of the late United Kingdom of Great Britain and Ireland which was on the 6th day of December, 1922, in force in the area now comprised in Saorstát Eireann
ga: —Ciallóidh an abairt “Reacht Briotáineach,” nuair éilíonn no a cheaduíonn an có-théacs é, Acht a dhin Páirlimint Ríochta Aontuithe na Breataine Móire agus na hÉireann a bhí ann le déanaí agus go raibh feidhm aige ar an 6adh lá de Mhí na Nodlag, 1922, sa líomatáiste gurb é Saorstát Éireann anois é

source: —This Act may be cited as the Adaptation of Enactments Act, 1922
ga: —Féadfar an t-Acht um Oiriúnú Achtanna, 1922 , do ghairm den Acht so
